FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC2478/LPC2478_Serial.c
/*-------------------------------------------------------------------------*
 * File:  Serial.c
 *-------------------------------------------------------------------------*
 * Description:
 *      LPC23xx 16550(?) Style serial ports
 * Implementation:
 *      Four serial ports are available (although they can be individually
 *      setup as needed).  Buffers/Queues are not stored here but handled
 *      by the layer above.  Only callback functions from within
 *      the IRQ are provided.
 *-------------------------------------------------------------------------*/

/*--------------------------------------------------------------------------
 * uEZ(R) - Copyright (C) 2007-2010 Future Designs, Inc.
 *--------------------------------------------------------------------------
 * This file is part of the uEZ(R) distribution.  See the included
 * uEZLicense.txt or visit http://www.teamfdi.com/uez for details.
 *
 *    *===============================================================*
 *    |  Future Designs, Inc. can port uEZ(tm) to your own hardware!  |
 *    |             We can get you up and running fast!               |
 *    |      See http://www.teamfdi.com/uez for more details.         |
 *    *===============================================================*
 *
 *-------------------------------------------------------------------------*/
#include "Config.h"
#include <uEZTypes.h>
#include <HAL/HAL.h>
#include <HAL/Interrupt.h>
#include <uEZPlatform.h>
#include <uEZProcessor.h>
#include <Source/Processor/NXP/LPC2478/LPC2478_Serial.h>
#include "LPC2478_UtilityFuncs.h"

// TBD:  not here!
#include <uEZRTOS.h>

/*---------------------------------------------------------------------------*
 * Constants and Macros:
 *---------------------------------------------------------------------------*/
#define BAUD_DIVIDER(b)         ((PROCESSOR_OSCILLATOR_FREQUENCY)/((b)*16))

/*---------------------------------------------------------------------------*
 * Types:
 *---------------------------------------------------------------------------*/
// Mapping of 16550 style registers in memory
typedef struct {
    /* 0x00 */
    union {
        volatile unsigned long RBR;
        volatile unsigned long THR;
        volatile unsigned long DLL;
    } reg00;
    /* 0x04 */
    union {
        volatile unsigned long DLM;
        volatile unsigned long IER;
    } reg04;
    /* 0x08 */
    union {
        volatile unsigned long IIR;
        volatile unsigned long FCR;
    } reg08;
    /* 0x0C */
    volatile unsigned long LCR;

    /* 0x10 */
    volatile unsigned long MCR;

    /* 0x14 */
    volatile unsigned long LSR;

    /* 0x18 */
    volatile unsigned long MSR;

    /* 0x1C */
    volatile unsigned long SCR;
    /* 0x20 */
    volatile unsigned long ACR;
    /* 0x24 */
    volatile unsigned long ICR;
    /* 0x28 */
    volatile unsigned long FDR;
    /* 0x2C */
    volatile unsigned long reserved_0x2C;
    /* 0x30 */
    volatile unsigned long TER;
} T_16550UART;

// Entry of serial port settings
typedef struct {
    TUInt32 iInterruptChannel;
    T_irqPriority iPriority;
    T_16550UART *iUART;
    TISRFPtr iISR;
    TUInt8 iPowerBitIndex; // PCONP bit to set
} T_Serial_LPC2478_SerialInfo;

typedef struct {
    const HAL_Serial *iHAL;
    const T_Serial_LPC2478_SerialInfo *iInfo;
    HAL_Serial_Callback_Transmit_Empty iTransmitEmptyFunc;
    HAL_Serial_Callback_Received_Byte iReceivedByteFunc;
    void *iCallbackWorkspace;
    T_Serial_Settings iSettings;
} T_Serial_LPC2478_Workspace;

/*---------------------------------------------------------------------------*
 * Function Prototypes:
 *---------------------------------------------------------------------------*/
//#define ISerialGrab(entry)         InterruptDisable(entry->iInterruptChannel);
//#define ISerialRelease(entry)      InterruptEnable(entry->iInterruptChannel);
IRQ_ROUTINE(ISerialUART0);
IRQ_ROUTINE(ISerialUART1);
IRQ_ROUTINE(ISerialUART2);
IRQ_ROUTINE(ISerialUART3);

/*---------------------------------------------------------------------------*
 * Globals:
 *---------------------------------------------------------------------------*/
extern const HAL_Serial G_LPC2478_Serial_UART0;
extern const HAL_Serial G_LPC2478_Serial_UART1;
extern const HAL_Serial G_LPC2478_Serial_UART2;
extern const HAL_Serial G_LPC2478_Serial_UART3;

extern const T_Serial_LPC2478_SerialInfo G_LPC2478_Serial_Info_UART0;
extern const T_Serial_LPC2478_SerialInfo G_LPC2478_Serial_Info_UART1;
extern const T_Serial_LPC2478_SerialInfo G_LPC2478_Serial_Info_UART2;
extern const T_Serial_LPC2478_SerialInfo G_LPC2478_Serial_Info_UART3;

T_Serial_LPC2478_Workspace *G_UART0Workspace=0;
T_Serial_LPC2478_Workspace *G_UART1Workspace=0;
T_Serial_LPC2478_Workspace *G_UART2Workspace=0;
T_Serial_LPC2478_Workspace *G_UART3Workspace=0;

/*---------------------------------------------------------------------------*
 * Routine:  ISerialProcessInterrupt
 *---------------------------------------------------------------------------*
 * Description:
 *      Generic routine for handling any of the serial ports (as passed
 *      into the routine.
 *      NOTE:  This routine is ALWAYS processed inside of a interrupt
 *              service routine.
 * Inputs:
 *      T_SerialPortEntry *p      -- Port's definition to process interrupt
 *---------------------------------------------------------------------------*/
static void ISerialProcessInterrupt(T_Serial_LPC2478_Workspace *p)
{
    TUInt8 iir;

    // Process states until completely done (no more interrupts)
    while (((iir = p->iInfo->iUART->reg08.IIR) & 0x01) == 0) {
        // Process that state or return
        switch ((iir>>1) & 7)
        {
            case 0x1:
                // Just ran out of bytes, please transmit more
                // (or we stop here)
                p->iTransmitEmptyFunc(p->iCallbackWorkspace, 8);
                break;
            case 0x2:
            case 0x6:  //Character time out indicator interrupt (CTI)
                // We have received 1 or more bytes.  Please do
                // something with this received byte
                p->iReceivedByteFunc(
                    p->iCallbackWorkspace,
                    p->iInfo->iUART->reg00.RBR);
                break;
            case 0x0:  //Modem interrupt
            case 0x3:  //Receive line status interrupt (RDA)
            default:
                // Ignore rest of states
                return;
        }
    }
}

/*---------------------------------------------------------------------------*
 * Routine:  ISerialUART0
 *---------------------------------------------------------------------------*
 * Description:
 *      Capture the UART0 interrupt and forward to ISerialProcessInterrupt.
 *---------------------------------------------------------------------------*/
IRQ_ROUTINE(ISerialUART0)
{
    IRQ_START();
    ISerialProcessInterrupt(G_UART0Workspace);
    IRQ_END();
}

/*---------------------------------------------------------------------------*
 * Routine:  ISerialUART1
 *---------------------------------------------------------------------------*
 * Description:
 *      Capture the UART1 interrupt and forward to ISerialProcessInterrupt.
 *---------------------------------------------------------------------------*/
IRQ_ROUTINE(ISerialUART1)
{
    IRQ_START();
    ISerialProcessInterrupt(G_UART1Workspace);
    IRQ_END();
}

/*---------------------------------------------------------------------------*
 * Routine:  ISerialUART2
 *---------------------------------------------------------------------------*
 * Description:
 *      Capture the UART2 interrupt and forward to ISerialProcessInterrupt.
 *---------------------------------------------------------------------------*/
IRQ_ROUTINE(ISerialUART2)
{
    IRQ_START();
    ISerialProcessInterrupt(G_UART2Workspace);
    IRQ_END();
}

/*---------------------------------------------------------------------------*
 * Routine:  ISerialUART3
 *---------------------------------------------------------------------------*
 * Description:
 *      Capture the UART3 interrupt and forward to ISerialProcessInterrupt.
 *---------------------------------------------------------------------------*/
IRQ_ROUTINE(ISerialUART3)
{
    IRQ_START();
    ISerialProcessInterrupt(G_UART3Workspace);
    IRQ_END();
}

/*---------------------------------------------------------------------------*
 * Routine:  SerialSendChar
 *---------------------------------------------------------------------------*
 * Description:
 *      Send a single character out the given serial port.
 *      NOTE:  Does not block even if output queue is full!
 * Inputs:
 *      T_serialPort aPort        -- Serial port to use
 *      TUInt8 c                  -- Character to send
 * Outputs:
 *      T_uezError                 -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC2478_Serial_OutputByte(void *aWorkspace, TUInt8 aByte)
{
    T_Serial_LPC2478_Workspace *p = (T_Serial_LPC2478_Workspace *)aWorkspace;
    p->iInfo->iUART->reg00.THR = aByte;
    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  SerialDisable
 *---------------------------------------------------------------------------*
 * Description:
 *      Disable serial processing on this port.
 * Inputs:
 *      T_serialPort aPort        -- Serial port to disable
 * Outputs:
 *      T_uezError                 -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC2478_Serial_Deactivate(void *aWorkspace)
{
    T_Serial_LPC2478_Workspace *p = (T_Serial_LPC2478_Workspace *)aWorkspace;
    InterruptDisable(p->iInfo->iInterruptChannel);
    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  SerialEnable
 *---------------------------------------------------------------------------*
 * Description:
 *      Enable serial processing on this port.
 * Inputs:
 *      T_serialPort aPort        -- Serial port to enable
 * Outputs:
 *      T_uezError                 -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC2478_Serial_Activate(void *aWorkspace)
{
    T_Serial_LPC2478_Workspace *p = (T_Serial_LPC2478_Workspace *)aWorkspace;
    InterruptEnable(p->iInfo->iInterruptChannel);
    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC2478_Serial_InitializeWorkspace_UART0
 *---------------------------------------------------------------------------*
 * Description:
 *      Initialize a serial port workspace for UART0
 * Inputs:
 *      T_serialPort aPort        -- Serial port to enable
 * Outputs:
 *      T_uezError                 -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC2478_Serial_InitializeWorkspace_UART0(void *aWorkspace)
{
    T_Serial_LPC2478_Workspace *p = (T_Serial_LPC2478_Workspace *)aWorkspace;
    G_UART0Workspace = p;
    p->iInfo = &G_LPC2478_Serial_Info_UART0;
    p->iCallbackWorkspace = 0;
    p->iReceivedByteFunc = 0;
    p->iTransmitEmptyFunc = 0;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC2478_Serial_InitializeWorkspace_UART1
 *---------------------------------------------------------------------------*
 * Description:
 *      Initialize a serial port workspace for UART1
 * Inputs:
 *      T_serialPort aPort        -- Serial port to enable
 * Outputs:
 *      T_uezError                 -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC2478_Serial_InitializeWorkspace_UART1(void *aWorkspace)
{
    T_Serial_LPC2478_Workspace *p = (T_Serial_LPC2478_Workspace *)aWorkspace;
    G_UART1Workspace = p;
    p->iInfo = &G_LPC2478_Serial_Info_UART1;
    p->iCallbackWorkspace = 0;
    p->iReceivedByteFunc = 0;
    p->iTransmitEmptyFunc = 0;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC2478_Serial_InitializeWorkspace_UART2
 *---------------------------------------------------------------------------*
 * Description:
 *      Initialize a serial port workspace for UART2
 * Inputs:
 *      T_serialPort aPort        -- Serial port to enable
 * Outputs:
 *      T_uezError                 -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC2478_Serial_InitializeWorkspace_UART2(void *aWorkspace)
{
    T_Serial_LPC2478_Workspace *p = (T_Serial_LPC2478_Workspace *)aWorkspace;
    G_UART2Workspace = p;
    p->iInfo = &G_LPC2478_Serial_Info_UART2;
    p->iCallbackWorkspace = 0;
    p->iReceivedByteFunc = 0;
    p->iTransmitEmptyFunc = 0;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC2478_Serial_InitializeWorkspace_UART3
 *---------------------------------------------------------------------------*
 * Description:
 *      Initialize a serial port workspace for UART3
 * Inputs:
 *      T_serialPort aPort        -- Serial port to enable
 * Outputs:
 *      T_uezError                 -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC2478_Serial_InitializeWorkspace_UART3(void *aWorkspace)
{
    T_Serial_LPC2478_Workspace *p = (T_Serial_LPC2478_Workspace *)aWorkspace;
    G_UART3Workspace = p;
    p->iInfo = &G_LPC2478_Serial_Info_UART3;
    p->iCallbackWorkspace = 0;
    p->iReceivedByteFunc = 0;
    p->iTransmitEmptyFunc = 0;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC2478_Serial_Configure
 *---------------------------------------------------------------------------*
 * Description:
 *      Link the serial port to a pair of callback routines and an
 *      associated callback workspace.  The callbacks are called when
 *      a byte is received and when the transmit buffer becomes empty.
 * Inputs:
 *      void *aWorkspace          -- Serial port workspace
 *      void *aCallbackWorkspace  -- Callback's workspace
 *      HAL_Serial_Callback_Received_Byte aReceivedByteCallback
 *                                -- Callback routine for received bytes
 *      HAL_Serial_Callback_Transmit_Empty aTransmitEmptyCallback
 *                                -- Callback routine for transmit empty
 * Outputs:
 *      T_uezError                 -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC2478_Serial_Configure(
        void *aWorkspace,
        void *aCallbackWorkspace,
        HAL_Serial_Callback_Received_Byte aReceivedByteCallback,
        HAL_Serial_Callback_Transmit_Empty aTransmitEmptyCallback)
{
    T_Serial_LPC2478_Workspace *p = (T_Serial_LPC2478_Workspace *)aWorkspace;
    const T_Serial_LPC2478_SerialInfo *p_info = p->iInfo;
    TUInt32 divider ;

