FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC2478/LPC2478_Serial.c
    // Setup clk speed for UART0 to be divide 1, not divide 4
    PCLKSEL0 &= ~(3 << 6);
    PCLKSEL0 |= (1 << 6);
}

void LPC2478_UART1_Require(
        T_uezGPIOPortPin aPinTXD1,
        T_uezGPIOPortPin aPinRXD1,
        T_uezGPIOPortPin aPinCTS,
        T_uezGPIOPortPin aPinDCD,
        T_uezGPIOPortPin aPinDSR,
        T_uezGPIOPortPin aPinDTR,
        T_uezGPIOPortPin aPinRI,
        T_uezGPIOPortPin aPinRTS)
{
    static const T_LPC2478_PINSEL_ConfigList txd1[] = {
            {GPIO_P0_15, 1},
            {GPIO_P2_0,  2},
            {GPIO_P3_16, 3},
    };
    static const T_LPC2478_PINSEL_ConfigList rxd1[] = {
            {GPIO_P0_16, 1},
            {GPIO_P2_1,  2},
            {GPIO_P3_17, 3},
    };
    static const T_LPC2478_PINSEL_ConfigList cts[] = {
            {GPIO_P0_17, 1},
            {GPIO_P2_2,  2},
            {GPIO_P3_18, 3},
    };
    static const T_LPC2478_PINSEL_ConfigList dcd[] = {
            {GPIO_P0_18, 1},
            {GPIO_P2_3,  2},
            {GPIO_P3_19, 3},
    };
    static const T_LPC2478_PINSEL_ConfigList dsr[] = {
            {GPIO_P0_19, 1},
            {GPIO_P2_4,  2},
            {GPIO_P3_20, 3},
    };
    static const T_LPC2478_PINSEL_ConfigList dtr[] = {
            {GPIO_P0_20, 1},
            {GPIO_P2_5,  2},
            {GPIO_P3_21, 3},
    };
    static const T_LPC2478_PINSEL_ConfigList ri[] = {
            {GPIO_P0_21, 1},
            {GPIO_P2_6,  2},
            {GPIO_P3_22, 3},
    };
    static const T_LPC2478_PINSEL_ConfigList rts[] = {
            {GPIO_P0_22, 1},
            {GPIO_P2_7,  2},
            {GPIO_P3_30, 3},
    };

    HAL_DEVICE_REQUIRE_ONCE();
    HALInterfaceRegister("UART1", (T_halInterface *)&G_LPC2478_Serial_UART1, 0,
            0);
    LPC2478_PINSEL_ConfigPinOrNone(aPinTXD1, txd1, ARRAY_COUNT(txd1));
    LPC2478_PINSEL_ConfigPinOrNone(aPinRXD1, rxd1, ARRAY_COUNT(rxd1));
    LPC2478_PINSEL_ConfigPinOrNone(aPinCTS, cts, ARRAY_COUNT(cts));
    LPC2478_PINSEL_ConfigPinOrNone(aPinDCD, dcd, ARRAY_COUNT(dcd));
    LPC2478_PINSEL_ConfigPinOrNone(aPinDSR, dsr, ARRAY_COUNT(dsr));
    LPC2478_PINSEL_ConfigPinOrNone(aPinDTR, dtr, ARRAY_COUNT(dtr));
    LPC2478_PINSEL_ConfigPinOrNone(aPinRI, ri, ARRAY_COUNT(ri));
    LPC2478_PINSEL_ConfigPinOrNone(aPinRTS, rts, ARRAY_COUNT(rts));
    
    // Setup clk speed for UART1 to be divide 1, not divide 4
    PCLKSEL0 &= ~(3 << 8);
    PCLKSEL0 |= (1 << 8);
}

void LPC2478_UART2_Require(
        T_uezGPIOPortPin aPinTXD2,
        T_uezGPIOPortPin aPinRXD2)
{
    static const T_LPC2478_PINSEL_ConfigList txd2[] = {
            {GPIO_P0_10, 1},
            {GPIO_P2_8,  2},
            {GPIO_P4_22, 2},
    };
    static const T_LPC2478_PINSEL_ConfigList rxd2[] = {
            {GPIO_P0_11, 1},
            {GPIO_P2_9,  2},
            {GPIO_P4_23, 2},
    };

    HAL_DEVICE_REQUIRE_ONCE();
    HALInterfaceRegister("UART2", (T_halInterface *)&G_LPC2478_Serial_UART2, 0,
            0);
    LPC2478_PINSEL_ConfigPinOrNone(aPinTXD2, txd2, ARRAY_COUNT(txd2));
    LPC2478_PINSEL_ConfigPinOrNone(aPinRXD2, rxd2, ARRAY_COUNT(rxd2));

    // Setup clk speed for UART2 to be divide 1, not divide 4
    PCLKSEL1 &= ~(3 << 16);
    PCLKSEL1 |= (1 << 16);
}

void LPC2478_UART3_Require(
        T_uezGPIOPortPin aPinTXD3,
        T_uezGPIOPortPin aPinRXD3)
{
    static const T_LPC2478_PINSEL_ConfigList txd3[] = {
            {GPIO_P0_0,  2},
            {GPIO_P0_25, 3},
            {GPIO_P4_28, 3},
    };
    static const T_LPC2478_PINSEL_ConfigList rxd3[] = {
            {GPIO_P0_1,  2},
            {GPIO_P0_26, 3},
            {GPIO_P4_29, 3},
    };
    HAL_DEVICE_REQUIRE_ONCE();
    HALInterfaceRegister("UART3", (T_halInterface *)&G_LPC2478_Serial_UART3, 0,
            0);
    LPC2478_PINSEL_ConfigPinOrNone(aPinTXD3, txd3, ARRAY_COUNT(txd3));
    LPC2478_PINSEL_ConfigPinOrNone(aPinRXD3, rxd3, ARRAY_COUNT(rxd3));

    // Setup clk speed for UART3 to be divide 1, not divide 4
    PCLKSEL1 &= ~(3 << 18);
    PCLKSEL1 |= (1 << 18);
}

/*---------------------------------------------------------------------------*
 * Globals:
 *---------------------------------------------------------------------------*/
// List of serial port HAL interfaces
const HAL_Serial G_LPC2478_Serial_UART0 = {
    "Serial:LCP2478 UART0",
    0x0100,
    LPC2478_Serial_InitializeWorkspace_UART0,
    sizeof(T_Serial_LPC2478_Workspace),

    LPC2478_Serial_Configure,
    LPC2478_Serial_SetSerialSettings,
    LPC2478_Serial_GetSerialSettings,
    LPC2478_Serial_Activate,
    LPC2478_Serial_Deactivate,
    LPC2478_Serial_OutputByte,
    0,
    0,
    LPC2478_Serial_GetStatus,
};

const HAL_Serial G_LPC2478_Serial_UART1 = {
    "Serial:LCP2478 UART1",
    0x0100,
    LPC2478_Serial_InitializeWorkspace_UART1,
    sizeof(T_Serial_LPC2478_Workspace),

    LPC2478_Serial_Configure,
    LPC2478_Serial_SetSerialSettings,
    LPC2478_Serial_GetSerialSettings,
    LPC2478_Serial_Activate,
    LPC2478_Serial_Deactivate,
    LPC2478_Serial_OutputByte,
    LPC2478_Serial_SetHandshakingControl,
    LPC2478_Serial_GetHandshakingStatus,
    LPC2478_Serial_GetStatus,
};

const HAL_Serial G_LPC2478_Serial_UART2 = {
    "Serial:LCP2478 UART2",
    0x0100,
    LPC2478_Serial_InitializeWorkspace_UART2,
    sizeof(T_Serial_LPC2478_Workspace),

    LPC2478_Serial_Configure,
    LPC2478_Serial_SetSerialSettings,
    LPC2478_Serial_GetSerialSettings,
    LPC2478_Serial_Activate,
    LPC2478_Serial_Deactivate,
    LPC2478_Serial_OutputByte,
    0,
    0,
    LPC2478_Serial_GetStatus,
};

const HAL_Serial G_LPC2478_Serial_UART3 = {
    "Serial:LCP2478 UART3",
    0x0100,
    LPC2478_Serial_InitializeWorkspace_UART3,
    sizeof(T_Serial_LPC2478_Workspace),

    LPC2478_Serial_Configure,
    LPC2478_Serial_SetSerialSettings,
    LPC2478_Serial_GetSerialSettings,
    LPC2478_Serial_Activate,
    LPC2478_Serial_Deactivate,
    LPC2478_Serial_OutputByte,
    0,
    0,
    LPC2478_Serial_GetStatus,
};

const T_Serial_LPC2478_SerialInfo G_LPC2478_Serial_Info_UART0 = {
    INTERRUPT_CHANNEL_UART0,
    INTERRUPT_PRIORITY_HIGH,
    (T_16550UART *)UART0_BASE,
    (TISRFPtr)ISerialUART0,
    3, // PCUART0
};

const T_Serial_LPC2478_SerialInfo G_LPC2478_Serial_Info_UART1 = {
    INTERRUPT_CHANNEL_UART1,
    INTERRUPT_PRIORITY_HIGH,
    (T_16550UART *)UART1_BASE,
    (TISRFPtr)ISerialUART1,
    4, // PCUART1
};

const T_Serial_LPC2478_SerialInfo G_LPC2478_Serial_Info_UART2 = {
    INTERRUPT_CHANNEL_UART2,
    INTERRUPT_PRIORITY_HIGH,
    (T_16550UART *)UART2_BASE,
    (TISRFPtr)ISerialUART2,
    24, // PCUART2
};

const T_Serial_LPC2478_SerialInfo G_LPC2478_Serial_Info_UART3 = {
    INTERRUPT_CHANNEL_UART3,
    INTERRUPT_PRIORITY_HIGH,
    (T_16550UART *)UART3_BASE,
    (TISRFPtr)ISerialUART3,
    25, // PCUART3
};

/*===========================================================================*
 * END OF FILE:  SerialPorts.c
 *===========================================================================*/
